app/models/admin.rb

  def single_super_admin
    return unless column_names.include?("role")
    if Admin.where(role: 0).where.not(id: id).exists?
---
SELECT 1 AS one FROM "admins" WHERE "admins"."role" = $1 AND "admins"."id" != $2 LIMIT $3  [["role", 0], ["id", 2], ["LIMIT", 1]]